---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData
source: html/ffb25c4f-cd7a-bd51-8f78-3107a0955fc9.htm
---
# Autodesk.Revit.DB.Mechanical.DuctFittingAndAccessoryConnectorData

The input data used by external servers for calculation of the duct fitting and duct accessory coefficient.

## Syntax (C#)
```csharp
public class DuctFittingAndAccessoryConnectorData : IDisposable
```

## Remarks
width, height, diameter, flow, velocity pressure and connector index are input data for the calculation,